app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY title_header
---
  def index
    @movies = Movie.order(params[:sort])